TEXTS = {
    'en': {
        'select_language': 'Please select language:',
        'select_menu': 'Please select menu:',
        'selected_language': 'You have selected English language 🇬🇧',
        'next_action': '<b>Menu\n</b>Please select the next action:',
        'select_option': 'Please select an option:',
        'starting_low': 'Starting from low',
        'starting_high': 'Starting from high',
        'select_kb_item': 'To call up a menu or a language, you can select the corresponding menu items',
        'title': 'Title',
        'rating': 'Rating',
        'genres': 'Genres',
        'genre': 'Genre',
        'sort_by_rating': 'Sort by popularity',
        'user_rating': 'User rating',
        'release_date': 'Release date',
        'submenu_keyboard': ['Popular Now', 'By TMDB Rating', 'Use filters', 'Back'],
        'menu_keyboard': ['Movies', 'Series', 'Randomizer', 'Saved'],
        'LANGUAGE_CODES': 'en-US',
        'select_genre': 'Select a genre',
        'filter_submenu': ['By genre', 'By year', 'By viewer rating', 'By rating', 'Search', 'Back'],
        'release_date_options': [
            "Before 1980",
            "1980-2000",
            "2000-2020",
            "After 2020",
            "Any"
        ],
        'filter_releaseDate_txt': 'Choose release date',
        'movies': 'Movies',
        'series': 'Series',
        'back': 'Back',
        'save': 'Save',
        'delete': 'Delete',
        'another': 'Another',
        'vote_count_options': [
            "To 500",
            "From 500 to 1000",
            "From 1000",
            "Any"
        ],
        'filter_voteCount_txt': 'Choose vote count',
        'filter_rating_txt': 'Choose rating',
        'next_movies': 'Click "Back" to go to the previous page, "Next" to download the next movies, or "Reset" to start over.',
        'reset': 'Reset',
        'next': 'Next',
        'type': 'Type',
        'release_year': 'Release date',
        'adult': 'Adult?',
        'description': 'Description',
        'rating_card': 'Average user rating',
        'no': 'No',
        'yes': 'Yes',
        'movie': 'Movie',
        'tv': 'TV series',
        'seasons': 'Number of seasons',
        'help_text': "🤖 <b>Welcome to MovieBot!</b> 🎬\n\n"
                     "MovieBot is your personal movie and TV show guide. "
                     "Discover new movies, find information about your favorite films, "
                     "and save your must-watch list for later. Use the available commands "
                     "to explore the world of cinema!\n\n"
                     "<b>Available Commands:</b>\n"
                     "/start - Start using the bot\n"
                     "/menu - Open the main menu\n"
                     "/language - Choose your preferred language\n"
                     "/saved - View your saved movies and TV shows\n"
                     "/help - Display this help message\n\n"
                     "<b>How to Use:</b>\n"
                     "1. Start with /start to set up your preferences.\n"
                     "2. Use /menu to navigate through different options.\n"
                     "3. Explore movies, TV shows, and save your favorites with /saved.\n"
                     "4. Have fun exploring the world of entertainment! 🍿",
        'not_found_saved_content': "Oops, you don't have any saved movies or TV shows yet!\nWell, that's easy to fix.\n"
                                   "Just use the appropriate command to add content you like.",
        'second_tap_to_start': "You are already registered in the system.\nTo select a language, click on 👉/language.\nIf you want to familiarize yourself with the functionality of the bot, click on 👉/help.",
        'movie_list_reset': 'The movie list has been reset. Click "Next" to download the next 10 movies, or "Reset" to start over.',
        'filters_reset': 'Filters have been reset to default 👌',
        'no_filters': 'Well, without a filter we won\'t find out what you\'re looking for 🤔.',
        'no_results': 'No results found 🤷‍',
        'cannot_read_message': 'It seems I got into a difficult situation and cannot read your message.🙁\nPlease try to check your message and send it to me again.😄',
        'any_rating': 'Any rating (0-10)',
        'good_rating': 'Good rating (6-10)',
        'selected_filters': '<b>You have selected the following filters:</b>',
        'year': 'y.',
        'not_indicated': 'Not indicated',
        'any_rating_filter': 'Any rating',
        'popularity_desc': 'by descending',
        'popularity_asc': 'by ascending',
        'first_page': 'You are on the first page. Click "Next" to download the next 10 movies.',
        'save_yet': 'Saved',
    },
    'ua': {
        'select_language': 'Будь ласка, виберіть мову:',
        'select_menu': 'Будь ласка, виберіть меню:',
        'selected_language': '<b>Ви обрали українську мову </b>🇺🇦',
        'next_action': '<b>Меню\n</b>Будь ласка, виберіть наступну дію:',
        'select_option': 'Будь ласка, виберіть опцію:',
        'starting_low': 'Починаючи з низького',
        'starting_high': 'Починаючи з високого',
        'select_kb_item': 'Щоб викликати меню або мову, ви можете вибрати відповідні пункти меню',
        'title': 'Назва',
        'rating': 'Рейтинг',
        'genres': 'Жанри',
        'genre': 'Жанр',
        'sort_by_rating': 'Сортування за популярністю',
        'user_rating': 'Рейтинг глядачів',
        'release_date': 'Дата виходу',
        'submenu_keyboard': ['Популярне зараз', 'За рейтингом TMDB', 'Використовувати фільтри', 'Назад'],
        'menu_keyboard': ['Фільми', 'Серіали', 'Рандомайзер', 'Збережені'],
        'LANGUAGE_CODES': 'uk-UA',
        'select_genre': 'Виберіть жанр',
        'filter_submenu': ['За жанром', 'За роком', 'За рейтингом глядачів', 'За рейтингом', 'Пошук', 'Назад', ],
        'release_date_options': [
            "до 1980",
            "1980-2000",
            "2000-2020",
            "після 2020",
            "Без різниці"
        ],
        'filter_releaseDate_txt': 'Виберіть дату виходу',
        'movies': 'Фільми',
        'series': 'Серіали',
        'back': 'Назад',
        'save': 'Зберегти',
        'delete': 'Видалити',
        'another': 'Інший',
        'vote_count_options': [
            "До 500",
            "Від 500 до 1000",
            "Від 1000",
            "Будь-який"
        ],
        'filter_voteCount_txt': 'Виберіть кількість оцінок',
        'filter_rating_txt': 'Виберіть рейтинг',
        'next_movies': 'Натисніть "Назад", щоб перейти на попередню сторінку, "Далі", щоб завантажити наступні фільми, або "Скинути", щоб почати заново.',
        'reset': 'Скинути',
        'next': 'Далі',
        'type': 'Тип',
        'release_year': 'Дата виходу',
        'adult': 'Для дорослих?',
        'description': 'Опис',
        'rating_card': 'Cередній рейтинг глядачів',
        'no': 'Ні',
        'yes': 'Так',
        'movie': 'Фільм',
        'tv': 'Серіал',
        'seasons': 'Кількість сезонів',
        'help_text': "🤖 <b>Ласкаво просимо до MovieBot!</b> 🎬\n\n"
                     "MovieBot - це ваш особистий кінотеатральний гід. "
                     "Відкрийте для себе нові фільми, знайдіть інформацію про свої улюблені фільми, "
                     "і збережіть свій список обов'язкових до перегляду фільмів на потім. Використовуйте доступні команди "
                     "для дослідження світу кіно!\n\n"
                     "<b>Доступні команди:</b>\n"
                     "/start - Початок роботи з ботом\n"
                     "/menu - Відкрити головне меню\n"
                     "/language - Виберіть бажану мову\n"
                     "/saved - Переглянути збережені фільми та серіали\n"
                     "/help - Показати це довідкове повідомлення\n\n"
                     "<b>Як користуватися:</b>\n"
                     "1. Почніть з /start, щоб налаштувати свої уподобання.\n"
                     "2. Використовуйте /menu для навігації по різним варіантам.\n"
                     "3. Досліджуйте фільми, серіали та зберігайте свої улюблені за допомогою /saved.\n"
                     "4. Приємного відкриття світу розваг! 🍿",
        'not_found_saved_content': "Ой, у вас ще немає збережених фільмів чи серіалів!\nЩо ж, це легко виправити.\n"
                                   "Просто скористайтеся відповідною командою, щоб додати контент, який вам подобається.",
        'second_tap_to_start': "Ви вже зареєстровані в системі.\nДля того щоб вибрати мову, натисніть на 👉/language.\nЯкщо ви хочете ознайомитися з функціоналом бота, натисніть на 👉/help.",
        'movie_list_reset': 'Список фільмів скинуто. Натисніть "Далі", щоб завантажити наступні 10 фільмів, або "Скинути", щоб почати заново.',
        'filters_reset': 'Фільтри скинуто до значень за замовчуванням 👌',
        'no_filters': 'Що ж, без фільтра ми не дізнаємося, що ви шукаєте 🤔.',
        'no_results': 'Нічого не знайдено 🤷‍',
        'cannot_read_message': 'Здається, я потрапив в складну ситуацію і не можу прочитати твоє повідомлення.🙁\nБудь ласка, спробуй перевірити своє повідомлення і відправити мені ще раз.😄',
        'any_rating': 'Будь-який рейтинг (0-10)',
        'good_rating': 'Хороший рейтинг (6-10)',
        'selected_filters': '<b>Ви обрали наступні фільтри:</b>',
        'year': 'р.',
        'not_indicated': 'Не вказано',
        'any_rating_filter': 'Будь-який рейтинг',
        'popularity_desc': 'за спаданням',
        'popularity_asc': 'за зростанням',
        'first_page': 'Ви на першій сторінці. Натисніть "Далі", щоб завантажити наступні 10 фільмів.',
        'save_yet': 'Збережено',
    },
    'ru': {
        'select_language': 'Пожалуйста, выберите язык:',
        'select_menu': 'Пожалуйста, выберите меню:',
        'selected_language': 'Вы выбрали русский язык 🇷🇺',
        'next_action': '<b>Меню\n</b>Пожалуйста, выберите следующее действие:',
        'select_option': 'Пожалуйста, выберите опцию:',
        'starting_low': 'Начиная с низкого',
        'starting_high': 'Начиная с высокого',
        'select_kb_item': 'Для вызова меню или языка можно выбрать соответствующие пункты меню',
        'title': 'Название',
        'rating': 'Рейтинг',
        'genres': 'Жанры',
        'genre': 'Жанр',
        'sort_by_rating': 'Сортировка по популярности',
        'user_rating': 'Рейтинг зрителей',
        'release_date': 'Дата выхода',
        'submenu_keyboard': ['Популярно сейчас', 'По рейтингу TMDB', 'Использовать фильтры', 'Назад'],
        'menu_keyboard': ['Фильмы', 'Сериалы', 'Рандомайзер', 'Сохраненные'],
        'LANGUAGE_CODES': 'ru-RU',
        'select_genre': 'Выберите жанр',
        'filter_submenu': ['По жанру', 'По году', 'По кол-во оценок', 'По рейтингу', 'Поиск', 'Назад', ],
        'release_date_options': [
            "до 1980",
            "1980-2000",
            "2000-2020",
            "после 2020",
            "Без разницы"
        ],
        'filter_releaseDate_txt': 'Выберите дату выхода',
        'movies': 'Фильмы',
        'series': 'Сериалы',
        'back': 'Назад',
        'save': 'Сохранить',
        'delete': 'Удалить',
        'another': 'Другой',
        'vote_count_options': [
            "До 500",
            "От 500 до 1000",
            "От 1000",
            "Любой"
        ],
        'filter_voteCount_txt': 'Выберите кол-во оценок',
        'filter_rating_txt': 'Выберите рейтинг',
        'next_movies': 'Нажмите "Назад", чтобы перейти на предыдущую страницу, "Далее", чтобы загрузить следующие фильмы, или "Сброс", чтобы начать сначала.',
        'reset': 'Сбросить',
        'next': 'Далее',
        'type': 'Тип',
        'release_year': 'Дата выхода',
        'adult': 'Для взрослых?',
        'description': 'Описание',
        'rating_card': 'Cредний рейтинг зрителей',
        'no': 'Нет',
        'yes': 'Да',
        'movie': 'Фильм',
        'tv': 'Сериал',
        'seasons': 'Количество сезонов',
        'help_text': "🤖 <b>Добро пожаловать в MovieBot!</b> 🎬\n\n"
                     "<b>MovieBot</b> - это ваш личный кинотеатральный гид. "
                     "Откройте для себя новые фильмы, найдите информацию о своих любимых фильмах, "
                     "и сохраните свой список обязательных к просмотру фильмов на потом. Используйте доступные команды "
                     "для исследования мира кино!\n\n"
                     "<b>Доступные команды:</b>\n"
                     "/start - Начало работы с ботом\n"
                     "/menu - Открыть главное меню\n"
                     "/language - Выберите желаемый язык\n"
                     "/saved - Просмотреть сохраненные фильмы и сериалы\n"
                     "/help - Показать это справочное сообщение\n\n"
                     "<b>Как пользоваться:</b>\n"
                     "1. Начните с /start, чтобы настроить свои предпочтения.\n"
                     "2. Используйте /menu для навигации по разным вариантам.\n"
                     "3. Исследуйте фильмы, сериалы и сохраняйте свои любимые с помощью /saved.\n"
                     "4. Приятного открытия мира развлечений! 🍿",
        'not_found_saved_content': "Ой, у вас еще нет сохраненных фильмов или сериалов!\nЧто ж, это легко исправить.\n"
                                   "Просто воспользуйтесь соответствующей командой, чтобы добавить контент, который вам нравится.",
        'second_tap_to_start': "<b>Вы уже зарегистрированы в системе.</b>\nДля того чтобы выбрать язык, нажмите на 👉/language.\nЕсли вы хотие ознакомиться с функционалом бота, нажмите на 👉/help.",
        'movie_list_reset': 'Список фильмов сброшен. Нажмите "Далее", чтобы загрузить следующие 10 фильмов, или "Сброс", чтобы начать сначала.',
        'filters_reset': 'Фильтры сброшены до значений по умолчанию 👌',
        'no_filters': 'Что ж, без фильтра мы не узнаем, что вы ищете 🤔.',
        'no_results': 'Ничего не найдено 🤷‍',
        'cannot_read_message': 'Кажется, я попал в сложную ситуацию и не могу прочитать твоё сообщение.🙁\nПожалуйста, попробуй проверить своё сообщение иотправить мне еще раз.😄',
        'any_rating': 'Любой рейтинг (0-10)',
        'good_rating': 'Хороший рейтинг (6-10)',
        'selected_filters': '<b>Вы выбрали следующие фильтры:</b>',
        'year': 'г.',
        'not_indicated': 'Не указано',
        'any_rating_filter': 'Любой рейтинг',
        'popularity_desc': 'за убыванием',
        'popularity_asc': 'за возрастанием',
        'first_page': 'Вы на первой странице. Нажмите "Далее", чтобы загрузить следующие 10 фильмов.',
        'save_yet': 'Сохранено',
    },
}
