TEXTS = {
    'en': {
        'select_language': 'Please select language:',
        'select_menu': 'Please select menu:',
        'selected_language': 'You have selected English language 🇬🇧',
        'third_menu_option': 'You selected the third menu option.',
        'fourth_menu_option': 'You selected the fourth menu option.',
        'next_action': '<b>Menu\n</b>Please select the next action:',
        'select_option': 'Please select an option:',
        'starting_low': 'Starting from low',
        'starting_high': 'Starting from high',
        'select_kb_item': 'To call up a menu or a language, you can select the corresponding menu items',
        'title': 'Title',
        'rating': 'Rating',
        'genres': 'Genres',
        'submenu_keyboard': ['Popular Now', 'By TMDB Rating', 'Use filters', 'Back'],
        'menu_keyboard': ['Movies', 'Series', 'Randomizer', 'Saved'],
        'LANGUAGE_CODES': 'en-US',
        'select_genre': 'Select a genre',
        'filter_submenu': ['By genre', 'By year', 'By viewer rating', 'By rating', 'Search', 'Back'],
        'release_date_options': [
            "Before 1980",
            "1980-2000",
            "2000-2020",
            "After 2020",
            "Any"
        ],
        'filter_releaseDate_txt': 'Choose release date',
        'movies': 'Movies',
        'series': 'Series',
        'back': 'Back',
        'save': 'Save',
        'delete': 'Delete',
        'another': 'Another',
        'vote_count_options': [
            "To 500",
            "From 500 to 1000",
            "From 1000",
            "Any"
        ],
        'filter_voteCount_txt': 'Choose vote count',
        'filter_rating_txt': 'Choose rating',
        'next_5_movies': 'Click "Next" to download the next 5 movies, or "Reset" to start over.',
        'reset': 'Reset',
        'next': 'Next',
        'type': 'Type',
        'release_year': 'Release date',
        'adult': 'Adult?',
        'description': 'Description',
        'rating_card': 'Average user rating',
        'no': 'No',
        'yes': 'Yes',
        'movie': 'Movie',
        'tv': 'TV series',
        'seasons': 'Number of seasons',
        'help_text': "🤖 <b>Welcome to MovieBot!</b> 🎬\n\n"
                     "MovieBot is your personal movie and TV show guide. "
                     "Discover new movies, find information about your favorite films, "
                     "and save your must-watch list for later. Use the available commands "
                     "to explore the world of cinema!\n\n"
                     "<b>Available Commands:</b>\n"
                     "/start - Start using the bot\n"
                     "/menu - Open the main menu\n"
                     "/language - Choose your preferred language\n"
                     "/saved - View your saved movies and TV shows\n"
                     "/help - Display this help message\n\n"
                     "<b>How to Use:</b>\n"
                     "1. Start with /start to set up your preferences.\n"
                     "2. Use /menu to navigate through different options.\n"
                     "3. Explore movies, TV shows, and save your favorites with /saved.\n"
                     "4. Have fun exploring the world of entertainment! 🍿",
    },
    'ua': {
        'select_language': 'Будь ласка, виберіть мову:',
        'select_menu': 'Будь ласка, виберіть меню:',
        'selected_language': '<b>Ви обрали українську мову </b>🇺🇦',
        'third_menu_option': 'Ви обрали третю опцію меню.',
        'fourth_menu_option': 'Ви обрали четверту опцію меню.',
        'next_action': '<b>Меню\n</b>Будь ласка, виберіть наступну дію:',
        'select_option': 'Будь ласка, виберіть опцію:',
        'starting_low': 'Починаючи з низького',
        'starting_high': 'Починаючи з високого',
        'select_kb_item': 'Щоб викликати меню або мову, ви можете вибрати відповідні пункти меню',
        'title': 'Назва',
        'rating': 'Рейтинг',
        'genres': 'Жанри',
        'submenu_keyboard': ['Популярне зараз', 'За рейтингом TMDB', 'Використовувати фільтри', 'Назад'],
        'menu_keyboard': ['Фільми', 'Серіали', 'Рандомайзер', 'Збережені'],
        'LANGUAGE_CODES': 'uk-UA',
        'select_genre': 'Виберіть жанр',
        'filter_submenu': ['За жанром', 'За роком', 'За рейтингом глядачів', 'За рейтингом', 'Пошук', 'Назад', ],
        'release_date_options': [
            "до 1980",
            "1980-2000",
            "2000-2020",
            "після 2020",
            "Без різниці"
        ],
        'filter_releaseDate_txt': 'Виберіть дату виходу',
        'movies': 'Фільми',
        'series': 'Серіали',
        'back': 'Назад',
        'save': 'Зберегти',
        'delete': 'Видалити',
        'another': 'Інший',
        'vote_count_options': [
            "До 500",
            "Від 500 до 1000",
            "Від 1000",
            "Будь-який"
        ],
        'filter_voteCount_txt': 'Виберіть кількість оцінок',
        'filter_rating_txt': 'Виберіть рейтинг',
        'next_5_movies': 'Натисніть "Далі", щоб завантажити наступні 5 фільмів, або "Скинути", щоб почати заново.',
        'reset': 'Скинути',
        'next': 'Далі',
        'type': 'Тип',
        'release_year': 'Дата виходу',
        'adult': 'Для дорослих?',
        'description': 'Опис',
        'rating_card': 'Cередній рейтинг глядачів',
        'no': 'Ні',
        'yes': 'Так',
        'movie': 'Фільм',
        'tv': 'Серіал',
        'seasons': 'Кількість сезонів',
        'help_text': "🤖 <b>Ласкаво просимо до MovieBot!</b> 🎬\n\n"
                     "MovieBot - це ваш особистий кінотеатральний гід. "
                     "Відкрийте для себе нові фільми, знайдіть інформацію про свої улюблені фільми, "
                     "і збережіть свій список обов'язкових до перегляду фільмів на потім. Використовуйте доступні команди "
                     "для дослідження світу кіно!\n\n"
                     "<b>Доступні команди:</b>\n"
                     "/start - Початок роботи з ботом\n"
                     "/menu - Відкрити головне меню\n"
                     "/language - Виберіть бажану мову\n"
                     "/saved - Переглянути збережені фільми та серіали\n"
                     "/help - Показати це довідкове повідомлення\n\n"
                     "<b>Як користуватися:</b>\n"
                     "1. Почніть з /start, щоб налаштувати свої уподобання.\n"
                     "2. Використовуйте /menu для навігації по різним варіантам.\n"
                     "3. Досліджуйте фільми, серіали та зберігайте свої улюблені за допомогою /saved.\n"
                     "4. Приємного відкриття світу розваг! 🍿",
    },
    'ru': {
        'select_language': 'Пожалуйста, выберите язык:',
        'select_menu': 'Пожалуйста, выберите меню:',
        'selected_language': 'Вы выбрали русский язык 🇷🇺',
        'third_menu_option': 'Вы выбрали третью опцию меню.',
        'fourth_menu_option': 'Вы выбрали четвертую опцию меню.',
        'next_action': '<b>Меню\n</b>Пожалуйста, выберите следующее действие:',
        'select_option': 'Пожалуйста, выберите опцию:',
        'starting_low': 'Начиная с низкого',
        'starting_high': 'Начиная с высокого',
        'select_kb_item': 'Для вызова меню или языка можно выбрать соответствующие пункты меню',
        'title': 'Название',
        'rating': 'Рейтинг',
        'genres': 'Жанры',
        'submenu_keyboard': ['Популярно сейчас', 'По рейтингу TMDB', 'Использовать фильтры', 'Назад'],
        'menu_keyboard': ['Фильмы', 'Сериалы', 'Рандомайзер', 'Сохраненные'],
        'LANGUAGE_CODES': 'ru-RU',
        'select_genre': 'Выберите жанр',
        'filter_submenu': ['По жанру', 'По году', 'По кол-во оценок', 'По рейтингу', 'Поиск', 'Назад', ],
        'release_date_options': [
            "до 1980",
            "1980-2000",
            "2000-2020",
            "после 2020",
            "Без разницы"
        ],
        'filter_releaseDate_txt': 'Выберите дату выхода',
        'movies': 'Фильмы',
        'series': 'Сериалы',
        'back': 'Назад',
        'save': 'Сохранить',
        'delete': 'Удалить',
        'another': 'Другой',
        'vote_count_options': [
            "До 500",
            "От 500 до 1000",
            "От 1000",
            "Любой"
        ],
        'filter_voteCount_txt': 'Выберите кол-во оценок',
        'filter_rating_txt': 'Выберите рейтинг',
        'next_5_movies': 'Нажмите "Далее", чтобы загрузить следующие 5 фильмов, или "Сброс", чтобы начать сначала.',
        'reset': 'Сбросить',
        'next': 'Далее',
        'type': 'Тип',
        'release_year': 'Дата выхода',
        'adult': 'Для взрослых?',
        'description': 'Описание',
        'rating_card': 'Cредний рейтинг зрителей',
        'no': 'Нет',
        'yes': 'Да',
        'movie': 'Фильм',
        'tv': 'Сериал',
        'seasons': 'Количество сезонов',
        'help_text': "🤖 <b>Добро пожаловать в MovieBot!</b> 🎬\n\n"
                     "<b>MovieBot</b> - это ваш личный кинотеатральный гид. "
                     "Откройте для себя новые фильмы, найдите информацию о своих любимых фильмах, "
                     "и сохраните свой список обязательных к просмотру фильмов на потом. Используйте доступные команды "
                     "для исследования мира кино!\n\n"
                     "<b>Доступные команды:</b>\n"
                     "/start - Начало работы с ботом\n"
                     "/menu - Открыть главное меню\n"
                     "/language - Выберите желаемый язык\n"
                     "/saved - Просмотреть сохраненные фильмы и сериалы\n"
                     "/help - Показать это справочное сообщение\n\n"
                     "<b>Как пользоваться:</b>\n"
                     "1. Начните с /start, чтобы настроить свои предпочтения.\n"
                     "2. Используйте /menu для навигации по разным вариантам.\n"
                     "3. Исследуйте фильмы, сериалы и сохраняйте свои любимые с помощью /saved.\n"
                     "4. Приятного открытия мира развлечений! 🍿",
    },
}
